# Графический интерфейс

Разработать программу с графическим интерфейсом, вычисляющую сумму двух цифр.
Минимальные требования к интерфейсу: окно программы с двумя полями ввода и
кнопка для вычисления результата.

## Замечания

В качестве библиотеки элементов графического интерфейса я взял GTK 3.0,
поскольку она написана на Си и позволяет легко вызывать свои функции в
соответствии с ABI.

Параметры передаются через следующие регистры слева направо: `rdi`, `rsi`,
`rdx`, `rcx`, `r8`, `r9`. Результат возвращается через регистр `rax`.
